app/controllers/ankens_controller.rb

SELECT `ankens`.* FROM `ankens`
SELECT `tantos`.* FROM `tantos`
---
  def index
    @anken = Anken.new
    #検索条件用オブジェクト
    @anken_search = Anken.new
    anken_search = @anken_search

    #POSTされた場合
    if params[:anken].present?
      @anken.anken_name = params[:anken][:anken_name]
      @anken.anken_summary = params[:anken][:anken_summary]
      @anken.customer_id = params[:anken][:customer_id]
      @anken.tanto_id = params[:anken][:tanto_id]
      if params[:anken][:anken_status_cd].present?
        @anken.anken_status_cd = params[:anken][:anken_status_cd].map(&:to_i)

SELECT  `ankens`.* FROM `ankens` WHERE `ankens`.`id` = 1 LIMIT 1
---
  def show
    @anken = Anken.includes([:customer,:tanto,:code_mst,:section])
      .where(ankens: {id: params[:id]},sections: {del_flg: 0}, customers: {del_flg: 0},tantos: {del_flg: 0},
        code_msts: {category_cd: '0001',del_flg: 0})

INSERT INTO `ankens` (`customer_id`, `anken_name`, `anken_summary`, `anken_status_cd`, `tanto_id`, `last_update`, `remark`, `created_at`, `updated_at`) VALUES (23, '次世代マッチングStep2', 'データ解析を行い、Genesis、チャット、音声データなどが増加していったのちに、非構造データによる\r\n新しいマッチングを試みることになる。\r\nTipsの既存データの対応が完了したのちに、案件審議にあげてStep2を実施する予定。', 2, 3, 'Tetsuya.Sekine', 'ステップ１は実施中。', '2017-08-19 08:31:50', '2017-08-19 08:31:50')
---
  def create
    @anken = Anken.new(anken_params)
    #最終更新者をログインユーザーにセット
    setLastUpdateUser
    #validationチェック
    if @anken.invalid?
      getCustomers_for_options
      getTantos_for_options
      getCodemst_for_options('0001')
      getSections_for_options
      render :new, flash: {errors: @anken.errors.full_messages}
    else
      if @anken.save

UPDATE `ankens` SET `remark` = '開発以降に関して８月のIT委員会で審議をあげる。', `updated_at` = '2017-08-18 15:10:20' WHERE `ankens`.`id` = 2
---
  def update
    #最終更新者をログインユーザーにセット
    setLastUpdateUser
    if @anken.update(anken_params)

DELETE FROM `ankens` WHERE `ankens`.`id` = 1
---
  def destroy
    #最終更新者をログインユーザーにセット
    setLastUpdateUser
    if @anken.destroy

SELECT  `ankens`.* FROM `ankens` WHERE `ankens`.`id` = 1 LIMIT 1
---
  def comment
    @anken = Anken.find(params[:anken_id])

INSERT INTO `comments` (`anken_id`, `ymd`, `anken_comment`, `last_update`, `created_at`, `updated_at`) VALUES (1, '2017/08/24', 'トピックだよ。', 'tetsuya.sekine', '2017-08-24 15:09:40', '2017-08-24 15:09:40')
SELECT  `ankens`.* FROM `ankens` WHERE `ankens`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def comment_create
    @comment = Comment.new(comment_params)
    @comment.anken_id = params[:id]
    @comment.last_update = current_user.username
    if @comment.invalid?
      render :comment, flash: {errors: @comment.errors.full_messages}
    else
      if @comment.save
        @anken_by_comment = Anken.find(@comment.anken_id)