app/controllers/code_msts_controller.rb

SELECT `code_msts`.* FROM `code_msts`
---
  def index
    @code_msts = CodeMst.all

INSERT INTO `code_msts` (`category_cd`, `category_name`, `contents_cd`, `contents`, `del_flg`, `remark`, `created_at`, `updated_at`) VALUES ('0001', '案件ステータス', 1, '引合', 0, '', '2017-08-16 04:36:22', '2017-08-16 04:36:22')
---
  def create
    @code_mst = CodeMst.new(code_mst_params)
    if @code_mst.invalid?
      render :new, flash: {error: @code_mst.errors.full_messages}
    else
      if @code_mst.save

UPDATE `code_msts` SET `category_name` = 'test3', `updated_at` = '2017-08-17 05:12:23' WHERE `code_msts`.`id` = 8
---
  def update
    if @code_mst.update(code_mst_params)

DELETE FROM `code_msts` WHERE `code_msts`.`id` = 9
---
  def destroy
    if @code_mst.destroy