app/controllers/customers_controller.rb

SELECT `customers`.* FROM `customers`
---
  def index
    @customers = Customer.all

INSERT INTO `customers` (`customer`, `del_flg`, `created_at`, `updated_at`) VALUES ('PERSOL Process&Technology Co.', 0, '2017-08-14 03:34:10', '2017-08-14 03:34:10')
---
  def create
    @customer = Customer.new(customer_params)

    if @customer.invalid?
      #バリデーションエラーはエラー内容を返却。@customer.errors
      render :new, flash: {errors: @customer.errors.full_messages}
    else
      if @customer.save

UPDATE `customers` SET `customer` = 'test23332334', `del_flg` = 1, `updated_at` = '2017-08-14 12:40:16' WHERE `customers`.`id` = 1
---
  def update
    if @customer.valid?
      render :edit, flash: {errors: @customer.errors.full_messages}

    else
      if @customer.update(customer_params)

DELETE FROM `customers` WHERE `customers`.`id` = 1
---
  def destroy
    if @customer.destroy