app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`name`, `amount`, `created_at`, `updated_at`) VALUES ('アイテム１', 2, '2017-08-13 01:25:43', '2017-08-13 01:25:43')

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE `items` SET `amount` = 5, `updated_at` = '2017-08-13 01:25:56' WHERE `items`.`id` = 1

    def set_item
      @item = Item.find(params[:id])
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1