app/controllers/shains_controller.rb

SELECT `shains`.* FROM `shains`
---
  def index
    @shains = Shain.all.page(params[:page])

SELECT  `shains`.* FROM `shains` WHERE `shains`.`id` = 406 LIMIT 1
---
    def set_shain
      @shain = Shain.find(params[:id])