app/controllers/tantos_controller.rb

  def index
    @tantos = Tanto.all.page(params[:page])
---
SELECT `tantos`.* FROM `tantos`

  def create
    @tanto = Tanto.new(tanto_params)
    if @tanto.invalid?
      render :new, flash: {error: @tanto.errors.full_messages}
    else
      if @tanto.save
---
INSERT INTO `tantos` (`tanto_name`, `del_flg`, `created_at`, `updated_at`) VALUES ('営業部：森谷', 0, '2017-08-15 13:28:25', '2017-08-15 13:28:25')

  def update
    if @tanto.invalid?
      render :edit, flash: {errors: @tanto.errors.full_messages}
    else
      if @tanto.update(tanto_params)
---
UPDATE `tantos` SET `tanto_name` = '営業部：森谷 秀昭', `updated_at` = '2017-08-15 13:40:23' WHERE `tantos`.`id` = 2

  def destroy
    if @tanto.destroy
---
DELETE FROM `tantos` WHERE `tantos`.`id` = 1