app/views/ankens/index.html.erb

      <tr class="<%= change_style(anken.anken_status_cd) %>">
        <td rowspan="<%= anken.comment.length + 2 %>"><%= anken.id %></td>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`anken_id` = 1